Revit 2027 API
WireSet.Erase Method
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual int Erase(
	Wire item
)
Public Overridable Function Erase (
	item As Wire
) As Integer
public:
virtual int Erase(
	Wire^ item
)
abstract Erase :
        item : Wire -> int
override Erase :
        item : Wire -> int
Parameters
item Wire
Return Value
Int32
See Also
Reference
WireSet Class
Autodesk.Revit.DB.Electrical Namespace